# OuterDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSize..::..OuterDiameter Property
ConduitSize Class See Also
---
Outer diameter
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public double OuterDiameter { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OuterDiameter As Double
	Get
```

Visual C++
---
```text
public:
property double OuterDiameter {
	double get ();
}
```

# See Also
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace